# RemoveTreeControlItem

## Description
Removes an item from a Layout Manager tree control.

```pascal
FUNCTION RemoveTreeControlItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				nItemID      : INTEGER) : BOOLEAN;
```

```python

def vs.RemoveTreeControlItem(nDialogID, nComponentID, nItemID):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nItemID|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern